Revit 2027 API
RebarHandlePositionData.GetDistributionPath Method
 Gets the distribution path currently stored in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetDistributionPath()
Public Function GetDistributionPath As IList(Of Curve)
public:
IList<Curve^>^ GetDistributionPath()
member GetDistributionPath : unit -> IList<Curve>
Return Value
IList<Curve>
 Returns array of curves that represent the distribution path.
Remarks
 For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
See Also
Reference
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace